{
  "architectures": [
    "LlamaNSAForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama-nsa",
  "num_attention_heads": 32,
  "num_hidden_layers": 16,
  "num_key_value_heads": 2,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.0.dev0",
  "use_cache": true,
  "vocab_size": 128256,
  "block_size": 16,
  "block_counts": 16,
  "window_size": 0,
  "auto_map": {
        "AutoConfig": "configuration_llama_nsa.LlamaNSAConfig",
        "AutoModelForCausalLM": "modeling_llama_nsa.LlamaNSAForCausalLM"
  }
}
